{"entries":[{"title":"Rebase PR's in EW ","date":"2017-10-31T22:08:47.723Z","body":"* we're still using recursive tree calls - we probably shouldn't, or maybe we should but check for pagination?\n* test with like thousands of dummy files across a directory structure\n* document functions and improve self documentation, especially around the new rebasing methods only affecting the entry file"},{"title":"PV Plans","date":"2017-10-29T23:30:35.621Z","body":"## Home\n\n### Slider\n\n* Grace House splash\n* FB Live Streaming\n* Vision 2017 - Growing Healthy Families\n* Spanish service invitation\n* Connect times\n\n## Who We Are\n\n### Vision\n\nKnowing God’s call and living it.\n\nWe are a multi-generational, multi-ethnic family made up of sons and daughters of the living God.\n\nWe live on the right side of the cross knowing that, 2,000 years ago, Jesus declared, “It is finished!” We believe that God is no longer holding people’s sins against them, and we are free to walk in the full expression of everything God created us to be.\n\nWe are champions of the grace of God, with the full expectation that grace is the greatest catalyst for change known to man.\n\nOur mission includes ALL who are far away from God. We believe that God’s plan for reaching people far from Him has always been to have a people near to Him. As we live and breathe Jesus Christ wherever we go, people will experience the gravitational pull of His Mighty Presence in us.\n\nOur vision and passion is for people to discover their true identity in Christ once and for all to escape the clutches of the Identity Thief. We proclaim total deliverance from the Devil’s domain of darkness, and the absolute freedom for everyone to forcefully advance with the Kingdom of God.\n\n### Culture\n\nThe culture of Pleasant Valley, quite simply, is the culture of the Kingdom of Heaven. The list below describes the values and characteristics of our culture:\n\n* Presence of God\n* Voice of God\n* Grace\n* Redemption\n* Identity\n* Authority\n* Increase\n* Advance\n* Greatness\n\n### Leadership\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page7_item6_580e6f2d92fd9.jpg)\n\n# SCOTT HULL\n\n## Lead Pastor\n\nPastor Scott & his wife Susan have been serving in ministry together since 1986. Scott pastored here at Pleasant Valley from 1997-2003 as Associate Pastor, under the leadership of Founding Pastor Jim Schneider. The Hull family is thankful to the Lord for the privilege of having been mentored by the loving examples of Pastor Jim and Louise.\n\nFollowing their first season of ministry here, the Holy Spirit led the Hulls to pastor in other parts of the country for 10 years. In February of 2013, the Lord returned them once again to Pleasant Valley. Scott and Susan know it was God Who brought them back to New England, and in their own words: \"Not only do we know we are home here at PVCPP, we can**feel**that this is our home!\"\n\nThe Hulls have three grown children and 7 grandchildren. They are excited and invested in raising, blessing, and releasing the next generations in the Body of Christ.\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page7_item7_580e6f6555cb8.jpg)\n\n# RUSS HEMBEL\n\n## Staff Pastor\n\nPastor Russ and his wife Heather have been in ministry together for more than 14 years. While in university, Russ served as Youth Pastor for a church in Minnesota. Following graduation, Russ and Heather responded to the call to move to Southeastern Wisconsin where they served in various capacities including youth ministry. About 20 months after their arrival, Russ and Heather were installed as Lead Pastors and served in that capacity for eight years.\n\nAfter sensing their season of ministry in Wisconsin had come to a close, Russ and Heather were blessed by their church family of 10 years to step into the new season God had before them. In March of 2014, the Hembel family sensed the call of God to move to Southeastern Connecticut and accepted the invitation to minister at Pleasant Valley.\n\nRuss is passionate about calling forth God's best in people. His calling is to equip, empower, and release twenty and thirty-somethings into their God-initiated destiny.\n\nRuss enjoys courting Heather and playing with his kids. He’s a fan of the Green Bay Packers and Star Trek, loves anything with peanut butter, and has fun riding his scooter in the summer.\n\nHeather is called to equip families to realize their potential to change the world. She enjoys writing and homeschooling.\n\nThe Hembels have two awesome children under 10.\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page7_item8_580e6fe5cf3e2.png)\n\n# ELI ROSARIO\n\n## Spanish Pastor\n\nPastor Eli and Mirtelina Rosario are from Salinas, Puerto Rico where they have been pastors for 20 years.\n\nIn 2010, Eli and Mirtelina moved to the United States, obeying the Voice of God which told them their ministry would continue in New England. After settling in the area, the Rosario family has been in the ministry of music and preaching in different churches and places where they have been received all along the East Coast from 2010-2014.\n\nOn October 7, 2014, God directed the Rosario family to Pleasant Valley to become a part of what God is doing here.\n\nThis seemingly sudden development, in reality, is the result of God’s hand at work over many years, in multiple settings, families, and geographical locations.\n\nThe Word of God, set in motion over several decades, has suddenly come to pass and Pleasant Valley en Español is the fulfillment of that Word. In just two months time, December 7, 2014 was the inaugural worship gathering, giving God thanks for all that He has done, not only for the Rosarios, but also for Pleasant Valley.\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page7_item10_580e7004bd123.jpg)\n\n# ROBIN DEPOT\n\n## Minister of Children and Families; Facilities Manager\n\nBack in 2008, Robin was employed part-time by the public elementary school system working with special needs children. As she likes to say, she was “minding her own business” when God intervened and revealed His new and perfect plan for her. Towards the end of that year, she found herself in need of a full time job just as Pleasant Valley was looking for a full time custodian. God knew all along and brought her into our Staff Family in the beginning of 2009.\n\nIn November of 2011, Robin was engaged in her regular custodial duties in the Children’s Ministry area, when God intervened again and clearly called her to Children’s Ministry. Soon thereafter, Robin was installed as the Volunteer Director of Children’s Ministries.\n\nRobin believes that the children are going to change the world, and that it’s an awesome honor and privilege to be working with such an amazing team of teachers who love to nurture and invest into the lives of our children.\n\nIn February of 2015, Robin was recognized by the Elders as a Minister of the House, in several areas. First, she is now Staff Minister to Children and Families. Additionally, she has been recognized as a Minister at large to equip the Church in finding freedom**from**the past, and freedom**to**walk in our true identity in Christ.\n\nRobin is married to Gil and they have two grown sons. When they are not around the church, you can find them camping, kayaking, fishing, letter-boxing, snowshoeing, and going to the gym.\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page7_item23_580e704f493cf.jpg)\n\n# KAREN FOSHAY\n\n## Office Manager\n\nKaren went to school for accounting and after completing her degree in 2013 was asked what she was going to do next. At that point she was still hearing God’s direction in continuing to homeschool her children. She felt that God would show her the next step. As things began to shift at home it became clear that public school was the next path for her family. And it so happened that He had plans for her at Pleasant Valley. Beginning in June, 2015 Karen stepped into the position of Office Manager.\n\nKaren will be at the church to greet you and answer any questions you might have, make you an appointment with one of the pastors, and keep you up to date through the website, newsletter, and emails.\n\nKaren has been married to Johnee for ten years and have three children and a dog. She loves ministering through worship at Pleasant Valley, going to the beach, working out, and knitting.\n\n### Ministries\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page14_item3_54ee2a29cf5e3.jpg)\n\n# CHILDREN'S MINISTRY\n\n## Sunday 10am\n\nWe love kids at Pleasant Valley! From birth through 5th grade, our Children's Ministry blesses and speaks life into our children every week. We work hard to foster an environment in which our children will thrive in the love and presence of Jesus Christ so they can impact and change their world!\n\nOn Sunday mornings, there is child care available for newborns through 36 months. For the rest of our children, every week we choose to invest in them through the unique kid-friendly environment that we provide as we gather together as a church family. We choose not to separate our children from the rest of the family; instead we customize our gatherings to incorporate our kids and layer our content to be meaningful for children of all ages.\n\nOur church family goes to great lengths to ensure the well-being of our children. From safe facilities and learning areas for the children to extensive training and background screening for our ministry teams, we offer Kingdom best to the next generations!\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page14_item4_580e6c38eabea.jpg)\n\n# CONNECT - SMALL GROUPS\n\n## 2nd Wednesday of the Month 6:30pm\n\nCONNECT begins at 6:30pm in the Worship Center. We begin with a time of worship together followed by a brief message that will set the tone for the evening. At 7pm we are dismissed to different groups for a conversation time that will allow everyone an opportunity to interact with the message that was given.\n\nChildcare will be provided for birth-2year olds and a class for the 3-5year olds from the start of the evening at 6:30.\n\n1st through 5th graders will participate in the worship time with the adults and then be dismissed to their small group as well with a corresponding curriculum.\n\nWe were created to experience life through relationship with other people! Come join us Wednesday evenings!\n\nQuestions? Contact the office (860)446-1616\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page14_item5_54ee2b7c3792a.jpg)\n\n# PRAYER MINISTRY\n\n## Monday 12pm, Wednesday 6:30, Friday 5pm\n\nThe prayer ministry is a traveling prayer group that visits homes, hospitals, and several local churches to pray for and with others.\n\nMark 11:17 “My Temple will be called a House of Prayer for all Nations…”\n\nInterested? You can reach Will Aguele via[email](mailto:wilaguele@sbcglobal.net).\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page14_item2_580e6be5292df.jpg)\n\n# YOUTH MINISTRY\n\n## Wednesdays at 6:30pm\n\nPleasant Valley is all in when it comes to investing in the next generation. We hang out, play games, and have a blast. But that's not all. Our youth are rising up in their identities, worshiping their God, fellowshipping, and performing miracles when praying over their brothers and sisters, new faces, and youth leaders.\n\nStudents 6th through 12th grade are welcome! Come enjoy a safe and awesome place to hang out and be discipled in your walk with our God.\n\nMeeting weekly in the Youth Room on the east side of campus.\n\n### Volunteer Ministers\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page20_item18_54ee930215558.jpg)\n\n# WILL AGUELE\n\n## Minister of Prayer\n\nEquipping in Grace, Encouragement, and the Lifestyle Ministry of Prayer.\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page20_item20_580e70fe3d5e2.jpg)\n\n# ANNETTE DEGRAZIO\n\n## Minister of Encouragement\n\nEquipping the Body in the Ministry of Encouragement and Seeing Life from God's Perspective.\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page20_item21_580e713709c73.jpg)\n\n# HEATHER HEMBEL\n\n## Minister of Health and Families\n\nEquipping for Health in Families, Relationships, Marriages, Parenting and Ministry.\n\n![null](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/site_images/list_page20_item19_580e70a21cd78.jpg)\n\n# CARLOS ROSARIO\n\n## Minister of Youth\n\nEquipping the Youth and Next Generation to Walk with God.\n\n### Beliefs\n\n**GOD**- God is the Creator and Ruler of the universe. He has eternally existed in three separate, distinct persons/personalities: the Father, the Son, and the Holy Spirit. The three are co-equal and are one God.\n\n**JESUS CHRIST**- Jesus Christ is the Son of God. Jesus lived a sinless human life and offered Himself as the perfect sacrifice for the sins of all people by dying on a cross. He arose from the dead after three days to demonstrate His power over sin and death. He ascended to Heaven's glory and will return again someday to earth to reign as King of Kings, and Lord of Lords.\n\n**THE HOLY SPIRIT**- He is present in the world to make men aware of their need for Jesus Christ. He also lives in every Christian from the moment of salvation. His leadership brings our purpose, His anointing brings His gifts, and His fullness brings His fruit.\n\n**THE BIBLE**- The Bible is God's Word to us. It was written by human authors, under the supernatural guidance of the Holy Spirit. It is the supreme source of truth for Christian beliefs and living.\n\n**HUMAN BEINGS**- People are made in the spiritual image of God, to be like Him in character. Although every person has tremendous potential for good, all of us are marred by an attitude that separates people from God and causes many problems in life.\n\n**SALVATION**- We can never make up for our sin by self-improvement or being a good person. Only by trusting in Jesus Christ as God's offer of forgiveness, can anyone be saved from sin's penalty.\n\n**ETERNAL SECURITY**- Because God gives us eternal life through Jesus Christ, the true believer is secure in that salvation for eternity. Salvation is maintained by the grace and power of God, not by the self-effort of the Christian.\n\n**ETERNITY**- People were created to exist forever. We will either exist eternally separated from God by sin, or eternally with God through forgiveness and salvation. Heaven and hell are real places of eternal existence.\n\n[Click Here](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/documents/What%20We%20Believe.pdf) for an expanded statement of beliefs.\n\n## Worship Gatherings\n\n### 10AM Sunday\n\nJoin us as we come together and worship our Heavenly Father in Spirit and in Truth through relationship, music, giving, prayer, and the receiving of His Word. Let the Presence of God change your life and let His Word for this Moment find fertile soil in your heart.\n\nBe sure to arrive a little early to drop off your children birth to 36 months at our nursery located in the lower level of the middle building.\n\nOur worship gathering begins at 10am.\n\n### 10am Domingo\n\nUnase junto a nosotros y adoremos a nuestro Padre Celestial en espirítu y en verdad a trávez de una relación, musica, ofrenda, oración y la predicación de la poderosa Palabra de Dios. Dejé que la presencia de Dios cambie su vida y dejé que la palabra en esté Momento encuentre terreno fertíl en tu corazón.\n\nEl servicio comienza los Domingo a las 10am.\n\n### Child Care\n\nDuring our 10am Sunday morning gathering, we offer Child Care for children spanning newborns up until 36 months.\n\nBe sure to**arrive a little early**to check your children in and drop them off at our Nursery Rooms located in the middle building.\n\nTo learn more,[**Click Here**](http://www.pvcpp.org/who-we-are/ministries/?view=mobile)to visit our Children's Ministry description.\n\n### 6:30PM Wednesday\n\nWe do small groups on the second Wednesday of the month called Connect.\n\nCONNECT begins at 6:30pm in the Worship Center. We begin with a time of worship together followed by a brief message that will set the tone for the evening. At 7pm we are dismissed to different groups for a conversation time that will allow everyone an opportunity to interact with the message that was given.\n\nChildcare will be provided for birth-2year olds and a class for the 3-5year olds from the start of the evening at 6:30.\n\n1st through 5th graders will participate in the worship time with the adults and then be dismissed to their small group as well with a corresponding curriculum.\n\nWe were created to experience life through relationship with other people! Come join us Wednesday evenings!\n\nQuestions? Contact the office (860)446-1616\n\n### 6:30PM Miércoles\n\nUneté todo los miércoles en la noche para reunirnos a orar en el nombre del Señor, alabar y adorar a Dios y a estudiar la palabra de Dios. Ven a tener un encuentro en la presencia del Dios Todopoderoso.\n\nNos reunimos en el salón de los jóvenes a las 6:30pm.\n\n## Messages\n\nIf you would like to listen, simply click on the \"Launch Podcast Player\" button below.\n\n## Resources\n\n### 2017 Events Calendar\n\nOCTOBER\n\n1 - Communion Sunday\n\n4 - Connect 6:30pm\n\n11 - Connect 6:30pm\n\n15 - Sock It To Me Sunday Luncheon after Worship Gathering\n\n18 - Connect\n\n22 - Parent Child Dedication 10am\n\n25 - Connect 6:30pm\n\nNovember\n\n1 - Connect 6:30pm\n\n5 - Communion Sunday 10am\n\n8 - Connect 6:30pm\n\n11 - Veteran's Day\n\n15 - Connect 6:30pm\n\n19 - Sunday Supper after the Worship Gathering\n\n22 - Connect 6:30pm\n\n23 - Thanksgiving (offices closed)\n\n29 - Connect\n\n\\### Resource Links\n\n[**Click Here**](https://us11.admin.mailchimp.com/reports/show?id=1714093) for this week's**Newsletter**\n\n[**Click Here**](http://storage.cloversites.com/pleasantvalleycommunityofprayerpraise/documents/2017LGWebsite.pdf) for this trimester's**Small Group Catalog**\n\n[**Click Here**](https://pvcpp.churchcenteronline.com/giving) for**Online Giving**\n\n\\## Giving\n\nImage Link: https://pvcpp.churchcenteronline.com/giving\n\n\\## Contact\n\n**Pleasant Valley Community of Prayer and Praise**\n\n20 Grove Avenue\n\nGroton, CT 06340\n\n[**Click Here for Directions**](https://www.google.com/maps/dir//20%20Grove%20Ave,%20Groton,%20CT%2006340/@41.3672788,-72.0816246,17z/data=!4m13!1m4!3m3!1s0x89e60e9d30a0b597:0x488b112565dcd5e2!2s20%20Grove%20Ave,%20Groton,%20CT%2006340!3b1!4m7!1m0!1m5!1m1!1s0x89e60e9d30a0b597:0x488b112565dcd5e2!2m2!1d-72.0816246!2d41.3672788)\n\n**Phone:**860.446.1616\n\n**Email:**<mailto:office@pvcpp.org>\n\n**Office Hours:**\n\nMonday through Thursday 9am-3pm"},{"title":"Uploading assets for editorial workflow edits","date":"2017-10-24T18:10:53.353Z","body":"## Problem\n\nThe following gap exists for the media library in EW implementations:\n\n1. user creates and saves new EW draft entry\n2. a new asset is uploaded\n3. user edits the existing draft entry to use the newly uploaded image\n4. the image is 404 in deploy previews because it doesn't exist on the DP branch\n\n- - -\n\n## Solution\n\nWhen a file is inserted during changes to an existing EW entry:\n\n1. Use the file's SHA to determine if it's already on the entry's EW branch\n2. If it's not, add it to `mediaFiles` to be persisted with the entry\n\nBlobs should already be uploaded and accessible to all branches."},{"title":"UI Refresh: Top bar component","date":"2017-10-17T00:34:58.605Z","body":""},{"title":"UI Gaps","date":"2017-10-23T03:08:51.265Z","body":"* Universal loading state\n* No entries on collections page\n* No image available for avatar (top right in header)\n* Dropdowns - quick new, avatar (logout)\n* No image for entry card on collections page\n* Search results page heading\n* Indicate collection on individual entries when all collections are searched"},{"title":"UI Feedback","date":"2017-10-23T03:11:33.304Z","body":"* Is it worth having a description always visible in the collection view? It will probably be read most by new users, but the folks using a CMS installation a lot will want to get straight to content without the extra stuff."},{"title":"UI Overhaul Architecture","date":"2017-10-13T21:58:37.817Z","body":"## Resources\n\n* [Marvel prototype](https://marvelapp.com/6ggbi1e)\n\n## Components\n\n* Top bar (no New dropdown)\n* Collections view (no masthead)\n  * Side bar\n  * Collection list item\n  * Collection grid item"}]}